iPhoneGamesProjects-2009-07-02/19682 Chapter 2 - PJ Cabrera/simple_high_score_server/app/controllers/high_scores_controller.rb

  def show
    @high_score = HighScore.find(params[:id])
---
SELECT * FROM "high_scores" WHERE ("high_scores"."id" = 1)

  def edit
    @high_score = HighScore.find(params[:id])
---
SELECT * FROM "high_scores" WHERE ("high_scores"."id" = 1)

  def create
    @high_score = HighScore.new(params[:high_score])

    respond_to do |format|
      if @high_score.save
---
INSERT INTO "high_scores" ("score", "updated_at", "full_name", "created_at") VALUES(234037, '2009-02-18 06:54:32', 'Billy', '2009-02-18 06:54:32')

  def update
    @high_score = HighScore.find(params[:id])

    respond_to do |format|
      if @high_score.update_attributes(params[:high_score])
---
SELECT * FROM "high_scores" WHERE ("high_scores"."id" = 1)
UPDATE "high_scores" SET "score" = 10002, "updated_at" = '2009-02-18 06:55:54' WHERE "id" = 1

  def destroy
    @high_score = HighScore.find(params[:id])
    @high_score.destroy
---
SELECT * FROM "high_scores" WHERE ("high_scores"."id" = 4)
DELETE FROM "high_scores" WHERE "id" = 4